[
    {
        "id": "1",
        "title": "Full B2B Service Package",
        "slug": "full-service-package",
        "imgSrc": "/images/content/full-service.jpeg",
        "paragraphs": [
            "The B2B Full Service package is GTS’s most robust package for employers.",
            "We provide end-to-end support in the recruitment process from the time an employer creates a job description to the point in which they’ve hired a successful candidate.",
            "The employer is supported in standardizing their job descriptions on a global scale, verifying candidate credentials, evaluating candidates and understanding their fit for the role, identifying candidate competency gaps & how to close them, and developing a roadmap to close candidate gaps."
        ],
        "features": [
            "Terminology translation",
            "Credential verification",
            "Fit assessment & Gap Analysis",
            "Canadian coaching",
            "Access to GTS’s team expertise",
            "Identifying best Employer-Candidate match"
        ],
        "target_audience": "Employers",
        "package_type": "B2B",
        "whom_is_this_for": {
            "name": "Sarah, HR Director at a growing tech startup",
            "business_size": "30-200 employees",
            "business_needs": "Sarah is responsible for overseeing the entire recruitment process and wants to scale talent acquisition in a structured way as the company expands. Her company often hires international candidates but lacks the global expertise needed to ensure proper credential verification and fit for specific roles.",
            "pain_points": "Difficulty in evaluating international candidates, ensuring compliance with global hiring standards, and ensuring new hires are competent and fit for the role.",
            "goals": "To streamline and professionalize the recruitment process, ensure all hires are well-qualified, and reduce hiring mistakes that cost time and resources.",
            "package_fit": "The B2B Full Service Package provides Sarah with end-to-end recruitment support, from standardized job descriptions to credential verification and gap analysis. She values having a structured, expert-driven process to ensure hires are ready for success and meet the company’s growth needs."
        }
    },
    {
        "id": "2",
        "title": "Technology-enabled Recruitment Facilitation",
        "slug": "technology-enabled-recruitment-facilitation",
        "imgSrc": "/images/content/tech.jpeg",
        "paragraphs": [
            "Employers can access our vast global candidate database, standardize job descriptions, and verify candidate credentials.",
            "They handle candidate evaluation and gap identification.",
            "For employers: We provide our employers access to that database and support them in standardizing their job descriptions for global recruitment as well as verifying credentials of candidates they’ve found through out platform.",
            "For job-seekers: We provide global candidates with the ability to create a candidate profile and be included in our global candidate database and ensure that their credentials, education, and professional background is translated by GTS’s Smart Match Algorithm into best-fit-for-Canada profile."
        ],
        "features": [
            "Terminology Translation",
            "Credential Verification",
            "Talent Acquisition & Recruitment"
        ],
        "target_audience": "Employers and Job-seekers",
        "package_type": "B2B and B2C",
        "whom_is_this_for": [
            {
                "name": "John, Talent Acquisition Manager at a small manufacturing company",
                "business_size": "30-200 employees",
                "business_needs": "John’s company is growing, and they need to hire more skilled workers, but they have limited in-house recruitment resources. John is open to international hires but doesn't have the expertise to evaluate them properly.",
                "pain_points": "Overwhelmed by the recruitment process, not enough resources to vet international candidates, difficulty writing job descriptions that appeal globally.",
                "goals": "To find qualified global candidates without going over budget, ensure that the hiring process is more efficient, and create standardized job descriptions that work for international recruitment.",
                "package_fit": "Package 2: Technology-enabled Recruitment Facilitation offers John a simple solution—access to a global database of candidates, terminology translation, and credential verification. It allows him to streamline the hiring process without requiring extensive in-house recruitment expertise. He will be responsible for evaluating candidates, but the tools provided will help him navigate the global hiring landscape more effectively."
            },
            {
                "name": "Maria, International Candidate",
                "background": "Maria is an experienced IT professional seeking work in Canada.",
                "pain_points": "Uncertainty about the Canadian job market, limited access to resources to adapt her skills to Canadian standards.",
                "goals": "To find a rewarding job in Canada, upskill if necessary, and connect with employers who are open to hiring international talent.",
                "package_fit": "As part of the Package 2: Technology-enabled Recruitment Facilitation, Maria benefits from joining the global candidate database, where she can showcase her skills and be matched with employers. Terminology translation and credential verification will enhance her employability, helping her secure a position more easily."
            }
        ]
    },
    {
        "id": "3",
        "title": "Candidate Training & Development Roadmaps",
        "slug": "candidate-training-development-roadmaps",
        "imgSrc": "/images/content/image10.jpg",
        "paragraphs": [
            "A B2B and B2C package leverages our GTS Smart Match Alorithm that helps with evaluating overall fit between candidates and open roles, developing a roadmap to close identified gaps, and providing candidate coaching for candidates that have been identified for a role "
        ],
        "features": [
            "Fit Assessments, Gap Analysis, and Actionable Recommendations",
            "Candidate Coaching",
            "Access to GTS’s Team Expertise",
            "Tailored Training Programs",
            "Boosting Employee Morale",
            "Aligning Skills with Goals",
            "Fostering Career Growth & Roadmap"
        ],
        "titledFeatures": {
            "title": "Benefits of GTS’s Candidate Training & Development Roadmaps Service",
            "items": [
                {
                    "id": "1",
                    "title": "Tailored Training Programs",
                    "description": "Our training programs are customized to meet the specific needs of each employee, ensuring effective skill enhancement."
                },
                {
                    "id": "2",
                    "title": "Boosting Employee Morale",
                    "description": "Skill development initiatives not only enhance capabilities but also significantly improve employee satisfaction and morale."
                },
                {
                    "id": "3",
                    "title": "Aligning Skills with Goals",
                    "description": "We ensure that the skills developed through training align with the organisational goals, creating a more efficient workplace."
                },
                {
                    "id": "4",
                    "title": "Fostering Career Growth & Roadmap",
                    "description": "Development initiatives foster career growth, enabling employees to advance within the organisation and achieve their professional goals."
                },
                {
                    "id": "5",
                    "title": "Additional Description",
                    "description": "A B2B and B2C package that assists with fit assessments, gap analysis, and providing actionable recommendations and candidate coaching."
                }
            ]
        },
        "target_audience": "Employers and Job-seekers",
        "package_type": "B2B and B2C",
        "whom_is_this_for": [
            {
                "name": "Jake, HR Manager at a growing software company",
                "business_size": "30-200 employees",
                "business_needs": "Jake has identified some promising international candidates on his own or through the basic recruitment facilitation package but wants to ensure they are equipped with the right skills to integrate into the company. He needs a roadmap for each candidate, guiding their development.",
                "pain_points": "Uncertainty about how to transition new international hires into the company culture and provide them with necessary skills without significant delays.",
                "goals": "To onboard international hires successfully, minimize hiring risks, and ensure that new employees hit the ground running.",
                "package_fit": "The candidate training & development roadmaps package is ideal for Jake because it offers comprehensive assessments of candidate fit and development roadmaps that outline how to close skill gaps. By combining candidate coaching and expert recommendations, Jake can ensure that the hires he’s made are well-prepared for their roles and the company culture."
            },
            {
                "name": "Alex, International IT Specialist",
                "background": "Alex is looking for a job in Canada and has technical expertise in IT but lacks knowledge of certain Canadian technologies and methodologies.",
                "pain_points": "Concerned about his ability to meet Canadian employer expectations and worried about competing with local candidates.",
                "goals": "To enhance his skill set to become a more competitive candidate for Canadian employers and ensure he can thrive in his new role once hired.",
                "package_fit": "For Alex, the candidate training & development roadmap package provides a personalized roadmap to help him bridge any skill gaps identified during the recruitment process. By engaging in coaching and accessing expert insights, he can prepare himself for a successful transition to a Canadian workplace."
            }
        ]
    },
    {
        "id": "4",
        "title": "Corporate Consulting & Advisory Services",
        "slug": "corporate-consulting-advisory-services",
        "imgSrc": "/images/content/image17.jpg",
        "paragraphs": [
            "Tailor-made consulting services: A B2B package that offers tailor-made consulting services to employers through our analysis and recommendation engine.",
            "Our expert can generate insights related to industry trends, company hiring dynamics, and certifications.",
            "We assist with workforce planning, budgeting, and employee development."
        ],
        "features": [
            "Assessing Organisational Needs",
            "Developing HR Strategies",
            "Implementing Best Practices",
            "Providing Ongoing Support"
        ],
        "target_audience": "Employers",
        "package_type": "B2B",
        "whom_is_this_for": {
            "name": "Rachel, CEO of a rapidly expanding tech company",
            "business_size": "30-200 Employees",
            "business_needs": "Rachel is looking to optimize the company's talent strategy and future-proof their workforce. She needs insights on industry trends, talent acquisition best practices, and how to develop a sustainable employee growth strategy.",
            "pain_points": "Uncertainty about the company’s workforce planning for the next 3-5 years, difficulty in budgeting for global recruitment, and unsure of the certifications that are most beneficial for the company’s future needs.",
            "goals": "To have a clear, data-driven talent strategy that helps the company scale successfully and avoid costly hiring mistakes in the future.",
            "package_fit": "The corporate consulting & advisory services package is the perfect fit for Rachel. She will gain access to GTS’s expertise and data insights that will help her plan for the company’s future workforce needs. Custom solutions such as industry trend reports and workforce budgeting strategies will allow her to stay ahead of the curve."
        }
    }
]